frontend/controllers/ArticleController.php

    public function actionIndex()
    {
        $model=new query();
        $model->from(['keke_witkey_article','keke_witkey_article_category'])->where(
                "keke_witkey_article.art_cat_id=keke_witkey_article_category.art_cat_id")->all();

        $pages = new Pagination(['totalCount'=>$model->count(),'pageSize'=>5]);
        $data=$model->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT * FROM `keke_witkey_article`, `keke_witkey_article_category` WHERE keke_witkey_article.art_cat_id=keke_witkey_article_category.art_cat_id
SELECT COUNT(*) FROM `keke_witkey_article`, `keke_witkey_article_category` WHERE keke_witkey_article.art_cat_id=keke_witkey_article_category.art_cat_id
SELECT * FROM `keke_witkey_article`, `keke_witkey_article_category` WHERE keke_witkey_article.art_cat_id=keke_witkey_article_category.art_cat_id LIMIT 5

    public function actionSelec()
    {
        $model=new query();
        $model->from(['keke_witkey_article','keke_witkey_article_category'])->where(
                "keke_witkey_article.art_cat_id=keke_witkey_article_category.art_cat_id and art_id=".$_GET['art_id'])->all();

        $pages = new Pagination(['totalCount'=>$model->count(),'pageSize'=>5]);
        $data=$model->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT * FROM `keke_witkey_article`, `keke_witkey_article_category` WHERE keke_witkey_article.art_cat_id=keke_witkey_article_category.art_cat_id and art_id=246
SELECT COUNT(*) FROM `keke_witkey_article`, `keke_witkey_article_category` WHERE keke_witkey_article.art_cat_id=keke_witkey_article_category.art_cat_id and art_id=246
SELECT * FROM `keke_witkey_article`, `keke_witkey_article_category` WHERE keke_witkey_article.art_cat_id=keke_witkey_article_category.art_cat_id and art_id=246 LIMIT 5