frontend/controllers/CaseController.php

    public function actionIndex()
    {
       $arr = KekeWitkeyCase::find()->all();
---
SELECT * FROM `keke_witkey_case`